In [8]:
import pandas as pd

In [10]:
df = pd.read_csv("../data/weather.csv")

In [11]:
df

         Date   Time  Temp  Rainfall
0  2014-01-01  00:00  2.34      4.45
1  2014-01-01  12:00  6.70      8.34
2  2014-01-02  00:00 -1.34     10.25

In [12]:
df.columns

Index(['Date', 'Time', 'Temp', 'Rainfall'], dtype='object')

In [13]:
df.T

                   0           1           2
Date      2014-01-01  2014-01-01  2014-01-02
Time           00:00       12:00       00:00
Temp            2.34         6.7       -1.34
Rainfall        4.45        8.34       10.25